---
kind: type
id: T:Autodesk.Revit.UI.DockPosition
source: html/c28187c8-758f-76fe-6ded-1a98243fd20e.htm
---
# Autodesk.Revit.UI.DockPosition

Which part of the Revit application frame the pane should dock to.

## Syntax (C#)
```csharp
public enum DockPosition
```